[C] 4. Hogwarts Legacy 2
Имя входного файла: стандартный ввод
Имя выходного файла: стандартный вывод
Ограничение по времени: 1 секунда
Ограничение по памяти: 256 мегабайт

Только что вышло продолжение игры ¾Hogwarts Legacy¿. В ней, играя за главного героя, вы
должны бороться с монстрами и злыми волшебниками. Во второй версии добавили новый механизм
ограничения ресурсов: у игрока может быть несколько единиц энергии, которые он может тратить
на заклинания и затем восполнять. Изначально у игрока 0 единиц энергии.

Любое заклинание стоит 1 единицу энергии. Ограничения сверху на число единиц энергии у
игрока нет, но оно не может быть меньше нуля. Чтобы пополнять единицы энергии, надо пить
сливочное пиво. Каждая кружка сливочного пива добавляет фиксированное число единиц энергии
b.

Вам дан журнал игры с действиями четырех видов:
• cast – наложить заклинание. Гарантируется, что на этот момент есть хотя бы одна единица
энергии
• drink – выпить кружку целебного сливочного пива
• save – сохранить игру
• load – загрузить последнее сохранение. Если до этого не было ни одного сохранения, то игра
откатывается на начальное состояние.
После каждого действия выведите, сколько единиц энергии осталось у игрока.

Формат входных данных
В первой строке даны число действий в журнале – n (1 6 n 6 100), и сколько единиц энергии
прибавляет каждая кружка сливочного пива – b (1 6 b 6 100).
В следующих n строках описаны сами действия (каждое действие – одно из четырех допусти-
мых).

Формат выходных данных
Выведите n строк – для i-го действия выведите, сколько единиц энергии стало у героя после
него.

Пример
стандартный ввод стандартный вывод
8 4                        4
drink                     4
save                      3
cast                       2
cast                       6
drink                      6
save                      5
cast                       6
load
```python
import sys 


class Person:
    def __init__(self, beer_power: int) -> None:
        self.points = 0
        
        self.prev = 0
        self.beer_power = beer_power
    
    def drink(self) -> int:
        self.points += self.beer_power

        return self.points
    
    def cast(self) -> int:
        self.points -= 1

        return self.points
    
    def save(self) -> int:
        self.prev = self.points

        return self.points
    
    def load(self) -> int:
        self.points = self.prev

        return self.points
    

target = list(map(lambda x: x.replace("\n", "").strip(), sys.stdin.readlines()))
beer_power = target[0].split()[1]

person = Person(int(beer_power))

for event in target[1:]:
    print(getattr(person, event)())
```