[C] 5. Кубы палиндромы

Имя входного файла: стандартный ввод
Имя выходного файла: стандартный вывод
Ограничение по времени: 2 секунды
Ограничение по памяти: 256 мегабайт

Дано число N . Найдите максимальное число x, такое что выполняются следующие условия:
-  x <= N
- x = y3 для некоторого целого y (является кубом некоторого числа)
- x является палиндромом, то есть читается одинаково слева направо и справа налево (например,числа 404, 1001 – являются палиндромами, а 100, 443 – нет)

Формат входных данных:
В единственной строке дано число N (1 6 N 6 1018)

Формат выходных данных:
В единственной строке выведите одно число – ответ на задачу

Примеры:
стандартный ввод стандартный вывод
433 343
83293823928323 1334996994331

```python
import math
import sys

from typing import Callable


def check_palindrom(number: int) -> bool:
    if number % 2 == 0:
        return str(number) == str(number)[::-1]
    else:
        str_number = str(number)
        half = math.floor(len(str_number) / 2)

        return str_number[:half] == str_number[half + 1:][::-1]


def nearest_lower_cube(number: int, condition: Callable[[int], bool]):
    root = math.floor(number ** (1/3))
    target = int(math.pow(root, 3))

    while not condition(target):
        root = math.floor(target ** (1/3))
        target = int(math.pow(root, 3))
    
    return target


target_number = int(sys.stdin.readline())
print(nearest_lower_cube(target_number, check_palindrom))
```