Задача 1. Просто сложение

Имя входного файла: input.txt
Имя выходного файла: output.txt
Ограничение по времени: 1 секунда
Ограничение по памяти: 256 мегабайт

Степан Юрьевич, ученик выдающегося Юрия Степановича, решил на основе счета древ- них русов разработать систему сложения современных русов, дабы ускорить вычисления в существующих математических моделях. Сказано  сделано. И вот перед ним на столе лежит лист бумаги, на котором написана таблица суммирования новой системы. Осталось только научить компьютер складывать числа согласно этим правилам, и...

В программу закралась ошибка, и подсчет выполняется неправильно, ставя под угрозу результаты тысяч экспериментов. Нужно срочно что-то делать. Помогите Степану Юрьевичу написать новую программу, которая не будет допускать ошибок в вычислениях.

Сложение современных русов работает следующим образом. Пусть складываются два числа. Числа записаны в десятичной системе счисления. Процесс вычисления соответствует правилам вычисления чисел в столбик .

- Числа выравниваются по младшим разрядам.
- Если числа имеют одинаковую длину, то результирующее число тоже будет иметь та- кую же длину, а в каждом разряде будет записана цифра из заданной таблицы, которая определяется так: если в первом числе в 𝑘-м разряде находится цифра, равная 𝑖, а во втором числе в этом же 𝑘-м разряде записана цифра, равная 𝑗, то в 𝑘-й разряд ре- зультата будет записана цифра, которая находится на пересечении 𝑖-ой строки и 𝑗-го столбца таблицы ( 0 6 𝑖,𝑗6 9).
- В случае, если длины чисел различные, то в число меньшей длины слева от значащих цифр вместо ведущих нулей дописывается специальная цифра ‘@’. Правила сложения десятичных цифр со специальной цифрой тоже задаются табличкой.
- Правило сложения двух цифр ‘@’ не определено Ваша задача  вывести сумму двух заданных чисел.

Формат входных данных

В первых десяти строках входного файла записано по 10 цифр через пробел  таблица, разработанная Степаном Юрьевичем.

Сначала описываются правила сложения с 0 из первого числа, далее с 1 и так далее до 9.

В следующих двух строках задано по 10 цифр  результаты сложения цифры ‘@’ из первого числа с десятичной цифрой из второго и, соответственно, результаты сложения де- сятичной цифры из первого числа с цифрой ‘@’ из второго.

В следующей строке задано целое число 𝑄  количество заданий (𝑄6 103).

Далее в 𝑄строках заданы по два целых неотрицательных числа, которые нужно сложить. Длина каждого числа не превышает 103 символов.

Формат выходных данных

В выходной файл нужно вывести 𝑄строк, содержащих по одному числу  результату сложения соответствующей пары чисел.

Система оценки

Баллы за каждую подзадачу начисляются только в случае, если все тесты для этой под- задачи и необходимых подзадач успешно пройдены.

| Подзадача | Баллы | Ограничения                                           | Необходимые подзадачи |
| --------- | ----- | ----------------------------------------------------- | --------------------- |
| 1         | 0     | Тесты из условия                                      |                       |
| 2         | 20    | Числа не превышают 1018                               | 1                     |
| 3         | 30    | Числа имеют одинаковую длину                          | 1                     |
| 4         | 50    | 𝑄6 103, длины чисел варьируются от 1 до 103 символов | 1, 2, 3               |

Примеры

| input.txt                                                                                                                                                                                                                                                                                                                                   | output.txt                             |
| ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- | -------------------------------------- |
| <p>0 1 2 3 4 5 6 7 8 9 1 2 3 4 5 6 7 8 9 0 2 3 4 5 6 7 8 9 0 1 3 4 5 6 7 8 9 0 1 2 4 5 6 7 8 9 0 1 2 3 5 6 7 8 9 0 1 2 3 4 6 7 8 9 0 1 2 3 4 5 7 8 9 0 1 2 3 4 5 6 8 9 0 1 2 3 4 5 6 7 9 0 1 2 3 4 5 6 7 8 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 4</p><p>1 1123456789</p><p>1 1</p><p>3 3</p><p>00 7</p>                                  | <p>1123456780 2</p><p>6</p><p>07</p>   |
| <p>8 2 4 1 2 7 2 8 0 6 3 9 4 9 9 5 2 2 8 0 8 4 5 9 8 7 8 4 6 5</p><p>7 5 4 1 6 9 1 9 1 2 8 6 6 5 5 7 2 1 5 6 6 8 7 2 0 0 7 3 1 0 2 7 8 3 0 7 4 6 3 8 9 3 3 6 1 9 3 8 0 7 6 3 8 9 0 2 1 0 9 5 0 3 3 0 5 7 9 4 2 2 0 5 3 9 8 0 7 4 0 6 6 9 8 7 5 5 0 8 5 6 5</p><p>693 9072</p><p>9 3962347979 54436397 4286675697 0 8347</p><p>62 118221</p> | 6244 9673984642 8312297128 0988 550384 |

<h4>Solution</h4>
```python
from typing import Optional
import sys


def equate_length(*numbers: str):
    min_number, max_number = min(*numbers, key=len), max(*numbers, key=len)
    target_length = len(max_number)

    if numbers.index(min_number) == 0:
        return (
            f"{(target_length - len(min_number)) * "@"}{min_number}",
            max_number
        )
    
    else:
        return (
            max_number,
            f"{(target_length - len(min_number)) * "@"}{min_number}"
        )


def get_result(first, second, rules_map):
    if first == "@": first = 10
    if second == "@": first, second = 11, first
    
    return rules_map[int(first)][int(second)]
        


def task(stdin: str) -> Optional[str]:
    lines = stdin.split("\n")
    tasks = list(map(lambda entry: equate_length(*entry.split(" ")), lines[13:]))
    rules_map = list(map(lambda entry: entry.split(" "), lines[:12]))

    for numbers in tasks:
        print(
            "".join([get_result(numbers[0][i], numbers[1][i], rules_map) for i in range(len(numbers[0]))])
        )

print(task("".join(sys.stdin.readlines())))
```